<a href="https://colab.research.google.com/github/Gilbert9172/Introduction_to_Data_Science/blob/main/Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###Groupby 란?

*   같은 값을 하나로 묶어 통계 또는 집계 결과를 얻기 위해 사용하는 것이 groupby

# (1) GroupBy 메소드를 이용한 집계 (GroupBy aggregation using methods)

In [15]:
import numpy as np

import pandas as pd



# sample DataFrame

df = pd.DataFrame({'group': ['a', 'a', 'a', 'b', 'b', 'b'], 

                  'value_1': np.arange(6), 

                 'value_2': np.random.randn(6)})
# Making GroupBy object

df

  group  value_1   value_2
0     a        0 -0.584606
1     a        1 -0.984550
2     a        2 -0.680065
3     b        3 -1.878555
4     b        4 -1.676152
5     b        5 -1.226236

In [16]:
df.groupby('group').mean('value_1')[['value_1']]

       value_1
group
a            1
b            4

In [17]:
# Making GroupBy object
# groupby () : 집계 기준 설정.

grouped = df.groupby('group')

grouped

In [18]:
# grouped.size() 도 grouped.count()와 동일한 결과를 반환함

grouped.sum()

       value_1   value_2
group
a            3 -2.249221
b           12 -4.780943

In [19]:
grouped.mean()

       value_1   value_2
group
a            1 -0.749740
b            4 -1.593648

In [20]:
#한개 변수에 대해서만 GroupBy 집계를 하면 반환되는 결과는 Series가 됩니다.

grouped.sum()['value_2']

group
a   -2.249221
b   -4.780943
Name: value_2, dtype: float64

In [21]:
# 한개 변수에 대해 GroupBy 집계해서 나온 Series를 데이터프레임으로 만들고 싶으면 

# pd.DataFrame() 를 사용해서 집계 결과를 데이터프레임으로 변환

pd.DataFrame(grouped.sum()['value_2'])

        value_2
group
a     -2.249221
b     -4.780943

In [22]:
# df.groupby('컬럼이름').get_group('그룹이름') 
# 그룹화 한 범주중에 원하는 카테고리만 추출

x = df.groupby('group').get_group('a')
x

  group  value_1   value_2
0     a        0 -0.584606
1     a        1 -0.984550
2     a        2 -0.680065

###(1-2) 최소값, 최대값: min(), max()

In [23]:
grouped.min()

       value_1   value_2
group
a            0 -0.984550
b            3 -1.878555

In [24]:
grouped.max()

       value_1   value_2
group
a            2 -0.584606
b            5 -1.226236

###(1-3) 중심 경향: mean(), median()

In [25]:
# 그룹 내 non-NA 값들의 평균값 
grouped.mean()

       value_1   value_2
group
a            1 -0.749740
b            4 -1.593648

In [26]:
# 그룹 내 non-NA 값들의 중앙값
grouped.median()

       value_1   value_2
group
a            1 -0.680065
b            4 -1.676152

###(1-4) 퍼짐 정도: std(), var(), quantile()

In [27]:
# std(): 그룹 내 표준편차

grouped.std()

       value_1   value_2
group
a          1.0  0.208878
b          1.0  0.333894

In [28]:
# var() : 그룹 내 분산

grouped.var()

       value_1   value_2
group
a            1  0.043630
b            1  0.111485

In [29]:
grouped.quantile([0.75, 0.25])

            value_1   value_2
group
a     0.75      1.5 -0.632335
      0.25      0.5 -0.832307
b     0.75      4.5 -1.451194
      0.25      3.5 -1.777353

###(1-5) first(), last()

In [30]:
# first(): 그룹 내 non-NA 값 중 첫번째 값

grouped.first()

       value_1   value_2
group
a            0 -0.584606
b            3 -1.878555

In [31]:
# last(): 그룹 내 non-NA 값 중 마지막 값

grouped.last()

       value_1   value_2
group
a            2 -0.680065
b            5 -1.226236

### (1-6) describe()

In [32]:
# describe(): 그룹 별 기술 통계량 - 옆으로 길게

grouped.describe()['value_1']

       count  mean  std  min  25%  50%  75%  max
group
a        3.0   1.0  1.0  0.0  0.5  1.0  1.5  2.0
b        3.0   4.0  1.0  3.0  3.5  4.0  4.5  5.0

In [33]:
# describe().T: 그룹 별 기술통계량 - 세로로 길게

grouped.describe().T

group                 a         b
value_1 count  3.000000  3.000000
        mean   1.000000  4.000000
        std    1.000000  1.000000
        min    0.000000  3.000000
        25%    0.500000  3.500000
        50%    1.000000  4.000000
        75%    1.500000  4.500000
        max    2.000000  5.000000
value_2 count  3.000000  3.000000
        mean  -0.749740 -1.593648
        std    0.208878  0.333894
        min   -0.984550 -1.878555
        25%   -0.832307 -1.777353
        50%   -0.680065 -1.676152
        75%   -0.632335 -1.451194
        max   -0.584606 -1.226236

# (2) 함수를 이용한 GroupBy 집계: grouped.agg(functions)

In [ ]:
def iqr_func(x):

    q3, q1 = np.percentile(x, [75, 25])

    iqr = q3 - q1

    return iqr

In [ ]:
grouped.aggregate(iqr_func)

       value_1   value_2
group
a            1  0.613232
b            1  0.532643

In [ ]:
grouped.agg(iqr_func)

       value_1   value_2
group
a            1  0.613232
b            1  0.532643

In [ ]:
grouped.quantile([0.75, 0.25])

            value_1   value_2
group
a     0.75      1.5  0.652086
      0.25      0.5  0.038854
b     0.75      4.5 -0.432498
      0.25      3.5 -0.965141

# (3)여러개의 함수를 적용하여 GroupBy 집계하기 : grouped.agg(functions)

In [35]:
# GroupBy 집계하려는 함수들의 문자열 리스트(list)로 grouped.agg() 에 적용하는 방법

grouped.agg(['size', 'mean', 'std', 'min', 'max'])

      value_1                   value_2
         size mean  std min max    size      mean       std       min       max
group
a           3    1  1.0   0   2       3 -0.749740  0.208878 -0.984550 -0.584606
b           3    4  1.0   3   5       3 -1.593648  0.333894 -1.878555 -1.226236

In [36]:
function_list = ['size', 'mean', 'std', 'min', 'max']

grouped.agg(function_list)

      value_1                   value_2
         size mean  std min max    size      mean       std       min       max
group
a           3    1  1.0   0   2       3 -0.749740  0.208878 -0.984550 -0.584606
b           3    4  1.0   3   5       3 -1.593648  0.333894 -1.878555 -1.226236

In [37]:
def range_func(x):

    max_val = np.max(x)

    min_val = np.min(x)

    range_val = max_val - min_val

    return range_val



def iqr_func(x):

    q3, q1 = np.percentile(x, [75, 25])

    iqr = q3 - q1

    return iqr

In [38]:
# DICTS를 사용하여 칼럼별로 특정 groupby집게 함수를 적용

grouped.agg({'value_1': ['size','mean','std'],\
             'value_2' : [range_func, iqr_func]})

      value_1              value_2
         size mean  std range_func  iqr_func
group
a           3    1  1.0   0.399944  0.199972
b           3    4  1.0   0.652319  0.326159

In [41]:
grouped.agg({'value_1': ['size', 'mean', 'std'], 

            'value_2': [('Range', range_func), ('Inter-Quartile_Range', iqr_func)]})

      value_1             value_2
         size mean  std     Range Inter-Quartile_Range
group
a           3    1  1.0  0.399944             0.199972
b           3    4  1.0  0.652319             0.326159

# (4)여러개의 칼럼에 대해 다른 함수를 적용한 Group By 집계: grouped.apply(functions)

In [ ]:
# 여러개의 칼럼(Multiple Columns)에 대해서 각기 다른 함수들을 적용하는 방법

In [ ]:
import numpy as np

import pandas as pd



df1 = pd.DataFrame({'grp_col_1' : ['a', 'a', 'a', 'a', 'a', 'b', 'b', 'b', 'b', 'b'], 

                   'grp_col_2' : ['c', 'c', 'd', 'd', 'd', 'e', 'e', 'f', 'f', 'f'], 

                   'val_1' : np.arange(10),                   

                   'val_2' : np.random.randn(10)})
df1

  grp_col_1 grp_col_2  val_1     val_2
0         a         c      0  1.722933
1         a         c      1  1.209945
2         a         d      2 -2.199837
3         a         d      3 -1.367758
4         a         d      4 -1.210426
5         b         e      5  0.250303
6         b         e      6 -0.334461
7         b         f      7  0.394745
8         b         f      8  1.294281
9         b         f      9  0.792336

In [ ]:
def func(x):
    # 빈 dict선언
    d = {}

    d['val_1_mean'] = x['val_1'].mean()

    d['val_1_std'] = x['val_1'].std()

    d['val_2_max'] = x['val_2'].max()

    d['val_2_min'] = x['val_2'].min()

    d['val_2_range'] = x['val_2'].max() - x['val_2'].min()

    return pd.Series(d, index=['val_1_mean', 'val_1_std', 'val_2_max', 'val_2_min', 'val_2_range'])

In [ ]:
df1_return = df1.groupby(['grp_col_1','grp_col_2']).apply(func)
df1_return

                     val_1_mean  val_1_std  val_2_max  val_2_min  val_2_range
grp_col_1 grp_col_2
a         c                 0.5   0.707107   1.722933   1.209945     0.512988
          d                 3.0   1.000000  -1.210426  -2.199837     0.989411
b         e                 5.5   0.707107   0.250303  -0.334461     0.584764
          f                 8.0   1.000000   1.294281   0.394745     0.899536

In [ ]:
# 계층적 인덱스를 사용하고 싶지 않다면reset_index()

# 계층적 인덱스 전부 말고 일부만 선별해서 칼럼으로 변환을 하고 싶으면 
# reset_index(level='index_name') 처럼 reset_index() 의 안에 level 을 지정해주면 됩니다. 

df1_return.reset_index()

  grp_col_1 grp_col_2  val_1_mean  val_1_std  val_2_max  val_2_min  val_2_range
0         a         c         0.5   0.707107   1.722933   1.209945     0.512988
1         a         d         3.0   1.000000  -1.210426  -2.199837     0.989411
2         b         e         5.5   0.707107   0.250303  -0.334461     0.584764
3         b         f         8.0   1.000000   1.294281   0.394745     0.899536

In [ ]:
arrays = [['a', 'a', 'a', 'a', 'a', 'b', 'b', 'b', 'b', 'b'], 

         ['c', 'c', 'd', 'd', 'd', 'e', 'e', 'f', 'f', 'f']]

myindex = pd.MultiIndex.from_arrays(arrays, names=('grp_idx_1', 'grp_idx_2'))

 

df2 = pd.DataFrame({'val_1': np.arange(10), 

                    'val_2': np.random.randn(10)}, 

                   index = myindex)


df2

                     val_1     val_2
grp_idx_1 grp_idx_2
a         c              0 -0.536327
          c              1 -0.294739
          d              2 -1.006167
          d              3  0.170946
          d              4 -1.344140
b         e              5  0.278256
          e              6  0.374163
          f              7  0.540239
          f              8 -0.537295
          f              9  0.318532

In [ ]:
df3 = df2.groupby(level=['grp_idx_1', 'grp_idx_2']).apply(func)
df3

                     val_1_mean  val_1_std  val_2_max  val_2_min  val_2_range
grp_idx_1 grp_idx_2
a         c                 0.5   0.707107  -0.294739  -0.536327     0.241587
          d                 3.0   1.000000   0.170946  -1.344140     1.515086
b         e                 5.5   0.707107   0.374163   0.278256     0.095907
          f                 8.0   1.000000   0.540239  -0.537295     1.077534